Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
/**
 * \file
 *
 * \brief Component description for PTC
 *
 * Copyright (c) 2017 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef _SAME54_PTC_COMPONENT_
#define _SAME54_PTC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PTC */
/* ========================================================================== */


#define PTC_U2500
#define REV_PTC                     0x100

/* -------- PTC_CTRLA : (PTC Offset: 0x00) (R/W 16) Control A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint16_t ENABLE:1;         /*!< bit:      1  Enable                             */
    uint16_t PTCEN:1;          /*!< bit:      2  Touch Enable                       */
    uint16_t DUALSEL:2;        /*!< bit:  3.. 4  Dual Mode Trigger Selection        */
    uint16_t SLAVEEN:1;        /*!< bit:      5  Slave Enable                       */
    uint16_t RUNSTDBY:1;       /*!< bit:      6  Run in Standby                     */
    uint16_t ONDEMAND:1;       /*!< bit:      7  On Demand Control                  */
    uint16_t PRESCALER:3;      /*!< bit:  8..10  Prescaler Configuration            */
    uint16_t :4;               /*!< bit: 11..14  Reserved                           */
    uint16_t R2R:1;            /*!< bit:     15  Rail to Rail Operation Enable      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_CTRLA_Type;

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLA_OFFSET            0x00         /**< \brief (PTC_CTRLA offset) Control A */
#define PTC_CTRLA_RESETVALUE        _U_(0x0000)  /**< \brief (PTC_CTRLA reset_value) Control A */

#define PTC_CTRLA_SWRST_Pos         0            /**< \brief (PTC_CTRLA) Software Reset */
#define PTC_CTRLA_SWRST             (_U_(0x1) << PTC_CTRLA_SWRST_Pos)
#define PTC_CTRLA_ENABLE_Pos        1            /**< \brief (PTC_CTRLA) Enable */
#define PTC_CTRLA_ENABLE            (_U_(0x1) << PTC_CTRLA_ENABLE_Pos)
#define PTC_CTRLA_DUALSEL_Pos       3            /**< \brief (PTC_CTRLA) Dual Mode Trigger Selection */
#define PTC_CTRLA_DUALSEL_Msk       (_U_(0x3) << PTC_CTRLA_DUALSEL_Pos)
#define PTC_CTRLA_DUALSEL(value)    (PTC_CTRLA_DUALSEL_Msk & ((value) << PTC_CTRLA_DUALSEL_Pos))
#define   PTC_CTRLA_DUALSEL_BOTH_Val      _U_(0x0)   /**< \brief (PTC_CTRLA) Start event or software trigger will start a conversion on both PTCs */
#define   PTC_CTRLA_DUALSEL_INTERLEAVE_Val _U_(0x1)   /**< \brief (PTC_CTRLA) START event or software trigger will alternatingly start a conversion on PTC0 and PTC1 */
#define PTC_CTRLA_DUALSEL_BOTH      (PTC_CTRLA_DUALSEL_BOTH_Val    << PTC_CTRLA_DUALSEL_Pos)
#define PTC_CTRLA_DUALSEL_INTERLEAVE (PTC_CTRLA_DUALSEL_INTERLEAVE_Val << PTC_CTRLA_DUALSEL_Pos)
#define PTC_CTRLA_SLAVEEN_Pos       5            /**< \brief (PTC_CTRLA) Slave Enable */
#define PTC_CTRLA_SLAVEEN           (_U_(0x1) << PTC_CTRLA_SLAVEEN_Pos)
#define PTC_CTRLA_RUNSTDBY_Pos      6            /**< \brief (PTC_CTRLA) Run in Standby */
#define PTC_CTRLA_RUNSTDBY          (_U_(0x1) << PTC_CTRLA_RUNSTDBY_Pos)
#define PTC_CTRLA_ONDEMAND_Pos      7            /**< \brief (PTC_CTRLA) On Demand Control */
#define PTC_CTRLA_ONDEMAND          (_U_(0x1) << PTC_CTRLA_ONDEMAND_Pos)
#define PTC_CTRLA_PRESCALER_Pos     8            /**< \brief (PTC_CTRLA) Prescaler Configuration */
#define PTC_CTRLA_PRESCALER_Msk     (_U_(0x7) << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER(value)  (PTC_CTRLA_PRESCALER_Msk & ((value) << PTC_CTRLA_PRESCALER_Pos))
#define   PTC_CTRLA_PRESCALER_DIV2_Val    _U_(0x0)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 2 */
#define   PTC_CTRLA_PRESCALER_DIV4_Val    _U_(0x1)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 4 */
#define   PTC_CTRLA_PRESCALER_DIV8_Val    _U_(0x2)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 8 */
#define   PTC_CTRLA_PRESCALER_DIV16_Val   _U_(0x3)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 16 */
#define   PTC_CTRLA_PRESCALER_DIV32_Val   _U_(0x4)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 32 */
#define   PTC_CTRLA_PRESCALER_DIV64_Val   _U_(0x5)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 64 */
#define   PTC_CTRLA_PRESCALER_DIV128_Val  _U_(0x6)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 128 */
#define   PTC_CTRLA_PRESCALER_DIV256_Val  _U_(0x7)   /**< \brief (PTC_CTRLA) Peripheral clock divided by 256 */
#define PTC_CTRLA_PRESCALER_DIV2    (PTC_CTRLA_PRESCALER_DIV2_Val  << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV4    (PTC_CTRLA_PRESCALER_DIV4_Val  << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV8    (PTC_CTRLA_PRESCALER_DIV8_Val  << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV16   (PTC_CTRLA_PRESCALER_DIV16_Val << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV32   (PTC_CTRLA_PRESCALER_DIV32_Val << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV64   (PTC_CTRLA_PRESCALER_DIV64_Val << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV128  (PTC_CTRLA_PRESCALER_DIV128_Val << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_PRESCALER_DIV256  (PTC_CTRLA_PRESCALER_DIV256_Val << PTC_CTRLA_PRESCALER_Pos)
#define PTC_CTRLA_R2R_Pos           15           /**< \brief (PTC_CTRLA) Rail to Rail Operation Enable */
#define PTC_CTRLA_R2R               (_U_(0x1) << PTC_CTRLA_R2R_Pos)
#define PTC_CTRLA_MASK              _U_(0x87FB)  /**< \brief (PTC_CTRLA) MASK Register */

/* -------- PTC_EVCTRL : (PTC Offset: 0x02) (R/W  8) Event Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  FLUSHEI:1;        /*!< bit:      0  Flush Event Input Enable           */
    uint8_t  STARTEI:1;        /*!< bit:      1  Start Conversion Event Input Enable */
    uint8_t  FLUSHINV:1;       /*!< bit:      2  Flush Event Invert Enable          */
    uint8_t  STARTINV:1;       /*!< bit:      3  Start Conversion Event Invert Enable */
    uint8_t  RESRDYEO:1;       /*!< bit:      4  Result Ready Event Out             */
    uint8_t  WINMONEO:1;       /*!< bit:      5  Window Monitor Event Out           */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

