Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
#define PTC_EVCTRL_OFFSET           0x02         /**< \brief (PTC_EVCTRL offset) Event Control */
#define PTC_EVCTRL_RESETVALUE       _U_(0x00)    /**< \brief (PTC_EVCTRL reset_value) Event Control */

#define PTC_EVCTRL_FLUSHEI_Pos      0            /**< \brief (PTC_EVCTRL) Flush Event Input Enable */
#define PTC_EVCTRL_FLUSHEI          (_U_(0x1) << PTC_EVCTRL_FLUSHEI_Pos)
#define PTC_EVCTRL_STARTEI_Pos      1            /**< \brief (PTC_EVCTRL) Start Conversion Event Input Enable */
#define PTC_EVCTRL_STARTEI          (_U_(0x1) << PTC_EVCTRL_STARTEI_Pos)
#define PTC_EVCTRL_FLUSHINV_Pos     2            /**< \brief (PTC_EVCTRL) Flush Event Invert Enable */
#define PTC_EVCTRL_FLUSHINV         (_U_(0x1) << PTC_EVCTRL_FLUSHINV_Pos)
#define PTC_EVCTRL_STARTINV_Pos     3            /**< \brief (PTC_EVCTRL) Start Conversion Event Invert Enable */
#define PTC_EVCTRL_STARTINV         (_U_(0x1) << PTC_EVCTRL_STARTINV_Pos)
#define PTC_EVCTRL_RESRDYEO_Pos     4            /**< \brief (PTC_EVCTRL) Result Ready Event Out */
#define PTC_EVCTRL_RESRDYEO         (_U_(0x1) << PTC_EVCTRL_RESRDYEO_Pos)
#define PTC_EVCTRL_WINMONEO_Pos     5            /**< \brief (PTC_EVCTRL) Window Monitor Event Out */
#define PTC_EVCTRL_WINMONEO         (_U_(0x1) << PTC_EVCTRL_WINMONEO_Pos)
#define PTC_EVCTRL_MASK             _U_(0x3F)    /**< \brief (PTC_EVCTRL) MASK Register */

/* -------- PTC_DBGCTRL : (PTC Offset: 0x03) (R/W  8) Debug Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  DBGRUN:1;         /*!< bit:      0  Debug Run                          */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_DBGCTRL_OFFSET          0x03         /**< \brief (PTC_DBGCTRL offset) Debug Control */
#define PTC_DBGCTRL_RESETVALUE      _U_(0x00)    /**< \brief (PTC_DBGCTRL reset_value) Debug Control */

#define PTC_DBGCTRL_DBGRUN_Pos      0            /**< \brief (PTC_DBGCTRL) Debug Run */
#define PTC_DBGCTRL_DBGRUN          (_U_(0x1) << PTC_DBGCTRL_DBGRUN_Pos)
#define PTC_DBGCTRL_MASK            _U_(0x01)    /**< \brief (PTC_DBGCTRL) MASK Register */

/* -------- PTC_INPUTCTRL : (PTC Offset: 0x04) (R/W 16) Input Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t MUXPOS:5;         /*!< bit:  0.. 4  Positive Mux Input Selection       */
    uint16_t :2;               /*!< bit:  5.. 6  Reserved                           */
    uint16_t DIFFMODE:1;       /*!< bit:      7  Differential Mode                  */
    uint16_t MUXNEG:5;         /*!< bit:  8..12  Negative Mux Input Selection       */
    uint16_t :2;               /*!< bit: 13..14  Reserved                           */
    uint16_t DSEQSTOP:1;       /*!< bit:     15  Stop DMA Sequencing                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_INPUTCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INPUTCTRL_OFFSET        0x04         /**< \brief (PTC_INPUTCTRL offset) Input Control */
#define PTC_INPUTCTRL_RESETVALUE    _U_(0x0000)  /**< \brief (PTC_INPUTCTRL reset_value) Input Control */

#define PTC_INPUTCTRL_MUXPOS_Pos    0            /**< \brief (PTC_INPUTCTRL) Positive Mux Input Selection */
#define PTC_INPUTCTRL_MUXPOS_Msk    (_U_(0x1F) << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS(value) (PTC_INPUTCTRL_MUXPOS_Msk & ((value) << PTC_INPUTCTRL_MUXPOS_Pos))
#define   PTC_INPUTCTRL_MUXPOS_AIN0_Val   _U_(0x0)   /**< \brief (PTC_INPUTCTRL) PTC AIN0 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN1_Val   _U_(0x1)   /**< \brief (PTC_INPUTCTRL) PTC AIN1 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN2_Val   _U_(0x2)   /**< \brief (PTC_INPUTCTRL) PTC AIN2 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN3_Val   _U_(0x3)   /**< \brief (PTC_INPUTCTRL) PTC AIN3 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN4_Val   _U_(0x4)   /**< \brief (PTC_INPUTCTRL) PTC AIN4 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN5_Val   _U_(0x5)   /**< \brief (PTC_INPUTCTRL) PTC AIN5 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN6_Val   _U_(0x6)   /**< \brief (PTC_INPUTCTRL) PTC AIN6 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN7_Val   _U_(0x7)   /**< \brief (PTC_INPUTCTRL) PTC AIN7 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN8_Val   _U_(0x8)   /**< \brief (PTC_INPUTCTRL) PTC AIN8 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN9_Val   _U_(0x9)   /**< \brief (PTC_INPUTCTRL) PTC AIN9 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN10_Val  _U_(0xA)   /**< \brief (PTC_INPUTCTRL) PTC AIN10 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN11_Val  _U_(0xB)   /**< \brief (PTC_INPUTCTRL) PTC AIN11 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN12_Val  _U_(0xC)   /**< \brief (PTC_INPUTCTRL) PTC AIN12 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN13_Val  _U_(0xD)   /**< \brief (PTC_INPUTCTRL) PTC AIN13 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN14_Val  _U_(0xE)   /**< \brief (PTC_INPUTCTRL) PTC AIN14 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN15_Val  _U_(0xF)   /**< \brief (PTC_INPUTCTRL) PTC AIN15 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN16_Val  _U_(0x10)   /**< \brief (PTC_INPUTCTRL) PTC AIN16 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN17_Val  _U_(0x11)   /**< \brief (PTC_INPUTCTRL) PTC AIN17 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN18_Val  _U_(0x12)   /**< \brief (PTC_INPUTCTRL) PTC AIN18 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN19_Val  _U_(0x13)   /**< \brief (PTC_INPUTCTRL) PTC AIN19 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN20_Val  _U_(0x14)   /**< \brief (PTC_INPUTCTRL) PTC AIN20 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN21_Val  _U_(0x15)   /**< \brief (PTC_INPUTCTRL) PTC AIN21 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN22_Val  _U_(0x16)   /**< \brief (PTC_INPUTCTRL) PTC AIN22 Pin */
#define   PTC_INPUTCTRL_MUXPOS_AIN23_Val  _U_(0x17)   /**< \brief (PTC_INPUTCTRL) PTC AIN23 Pin */
#define   PTC_INPUTCTRL_MUXPOS_SCALEDCOREVCC_Val _U_(0x18)   /**< \brief (PTC_INPUTCTRL) 1/4 Scaled Core Supply */
#define   PTC_INPUTCTRL_MUXPOS_SCALEDVBAT_Val _U_(0x19)   /**< \brief (PTC_INPUTCTRL) 1/4 Scaled VBAT Supply */
#define   PTC_INPUTCTRL_MUXPOS_SCALEDIOVCC_Val _U_(0x1A)   /**< \brief (PTC_INPUTCTRL) 1/4 Scaled I/O Supply */
#define   PTC_INPUTCTRL_MUXPOS_BANDGAP_Val _U_(0x1B)   /**< \brief (PTC_INPUTCTRL) Bandgap Voltage */
#define   PTC_INPUTCTRL_MUXPOS_PTAT_Val   _U_(0x1C)   /**< \brief (PTC_INPUTCTRL) Temperature Sensor */
#define   PTC_INPUTCTRL_MUXPOS_CTAT_Val   _U_(0x1D)   /**< \brief (PTC_INPUTCTRL) Temperature Sensor */
#define   PTC_INPUTCTRL_MUXPOS_DAC_Val    _U_(0x1E)   /**< \brief (PTC_INPUTCTRL) DAC Output */
#define   PTC_INPUTCTRL_MUXPOS_PTC_Val    _U_(0x1F)   /**< \brief (PTC_INPUTCTRL) PTC output (only on PTC0) */
#define PTC_INPUTCTRL_MUXPOS_AIN0   (PTC_INPUTCTRL_MUXPOS_AIN0_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN1   (PTC_INPUTCTRL_MUXPOS_AIN1_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN2   (PTC_INPUTCTRL_MUXPOS_AIN2_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN3   (PTC_INPUTCTRL_MUXPOS_AIN3_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN4   (PTC_INPUTCTRL_MUXPOS_AIN4_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN5   (PTC_INPUTCTRL_MUXPOS_AIN5_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN6   (PTC_INPUTCTRL_MUXPOS_AIN6_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN7   (PTC_INPUTCTRL_MUXPOS_AIN7_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN8   (PTC_INPUTCTRL_MUXPOS_AIN8_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN9   (PTC_INPUTCTRL_MUXPOS_AIN9_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN10  (PTC_INPUTCTRL_MUXPOS_AIN10_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN11  (PTC_INPUTCTRL_MUXPOS_AIN11_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN12  (PTC_INPUTCTRL_MUXPOS_AIN12_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN13  (PTC_INPUTCTRL_MUXPOS_AIN13_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN14  (PTC_INPUTCTRL_MUXPOS_AIN14_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN15  (PTC_INPUTCTRL_MUXPOS_AIN15_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN16  (PTC_INPUTCTRL_MUXPOS_AIN16_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN17  (PTC_INPUTCTRL_MUXPOS_AIN17_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN18  (PTC_INPUTCTRL_MUXPOS_AIN18_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN19  (PTC_INPUTCTRL_MUXPOS_AIN19_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN20  (PTC_INPUTCTRL_MUXPOS_AIN20_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN21  (PTC_INPUTCTRL_MUXPOS_AIN21_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN22  (PTC_INPUTCTRL_MUXPOS_AIN22_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_AIN23  (PTC_INPUTCTRL_MUXPOS_AIN23_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_SCALEDCOREVCC (PTC_INPUTCTRL_MUXPOS_SCALEDCOREVCC_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_SCALEDVBAT (PTC_INPUTCTRL_MUXPOS_SCALEDVBAT_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_SCALEDIOVCC (PTC_INPUTCTRL_MUXPOS_SCALEDIOVCC_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_BANDGAP (PTC_INPUTCTRL_MUXPOS_BANDGAP_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_PTAT   (PTC_INPUTCTRL_MUXPOS_PTAT_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_CTAT   (PTC_INPUTCTRL_MUXPOS_CTAT_Val << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_DAC    (PTC_INPUTCTRL_MUXPOS_DAC_Val  << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_MUXPOS_PTC    (PTC_INPUTCTRL_MUXPOS_PTC_Val  << PTC_INPUTCTRL_MUXPOS_Pos)
#define PTC_INPUTCTRL_DIFFMODE_Pos  7            /**< \brief (PTC_INPUTCTRL) Differential Mode */
#define PTC_INPUTCTRL_DIFFMODE      (_U_(0x1) << PTC_INPUTCTRL_DIFFMODE_Pos)
#define PTC_INPUTCTRL_MUXNEG_Pos    8            /**< \brief (PTC_INPUTCTRL) Negative Mux Input Selection */
#define PTC_INPUTCTRL_MUXNEG_Msk    (_U_(0x1F) << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG(value) (PTC_INPUTCTRL_MUXNEG_Msk & ((value) << PTC_INPUTCTRL_MUXNEG_Pos))
#define   PTC_INPUTCTRL_MUXNEG_AIN0_Val   _U_(0x0)   /**< \brief (PTC_INPUTCTRL) PTC AIN0 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN1_Val   _U_(0x1)   /**< \brief (PTC_INPUTCTRL) PTC AIN1 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN2_Val   _U_(0x2)   /**< \brief (PTC_INPUTCTRL) PTC AIN2 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN3_Val   _U_(0x3)   /**< \brief (PTC_INPUTCTRL) PTC AIN3 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN4_Val   _U_(0x4)   /**< \brief (PTC_INPUTCTRL) PTC AIN4 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN5_Val   _U_(0x5)   /**< \brief (PTC_INPUTCTRL) PTC AIN5 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN6_Val   _U_(0x6)   /**< \brief (PTC_INPUTCTRL) PTC AIN6 Pin */
#define   PTC_INPUTCTRL_MUXNEG_AIN7_Val   _U_(0x7)   /**< \brief (PTC_INPUTCTRL) PTC AIN7 Pin */
#define   PTC_INPUTCTRL_MUXNEG_GND_Val    _U_(0x18)   /**< \brief (PTC_INPUTCTRL) Internal Ground */
#define PTC_INPUTCTRL_MUXNEG_AIN0   (PTC_INPUTCTRL_MUXNEG_AIN0_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN1   (PTC_INPUTCTRL_MUXNEG_AIN1_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN2   (PTC_INPUTCTRL_MUXNEG_AIN2_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN3   (PTC_INPUTCTRL_MUXNEG_AIN3_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN4   (PTC_INPUTCTRL_MUXNEG_AIN4_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN5   (PTC_INPUTCTRL_MUXNEG_AIN5_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN6   (PTC_INPUTCTRL_MUXNEG_AIN6_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_AIN7   (PTC_INPUTCTRL_MUXNEG_AIN7_Val << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_MUXNEG_GND    (PTC_INPUTCTRL_MUXNEG_GND_Val  << PTC_INPUTCTRL_MUXNEG_Pos)
#define PTC_INPUTCTRL_DSEQSTOP_Pos  15           /**< \brief (PTC_INPUTCTRL) Stop DMA Sequencing */
#define PTC_INPUTCTRL_DSEQSTOP      (_U_(0x1) << PTC_INPUTCTRL_DSEQSTOP_Pos)
#define PTC_INPUTCTRL_MASK          _U_(0x9F9F)  /**< \brief (PTC_INPUTCTRL) MASK Register */

/* -------- PTC_CTRLB : (PTC Offset: 0x06) (R/W 16) Control B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t LEFTADJ:1;        /*!< bit:      0  Left-Adjusted Result               */
    uint16_t FREERUN:1;        /*!< bit:      1  Free Running Mode                  */
    uint16_t CORREN:1;         /*!< bit:      2  Digital Correction Logic Enable    */
    uint16_t RESSEL:2;         /*!< bit:  3.. 4  Conversion Result Resolution       */
    uint16_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint16_t WINMODE:3;        /*!< bit:  8..10  Window Monitor Mode                */
    uint16_t WINSS:1;          /*!< bit:     11  Window Single Sample               */
    uint16_t :4;               /*!< bit: 12..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLB_OFFSET            0x06         /**< \brief (PTC_CTRLB offset) Control B */
#define PTC_CTRLB_RESETVALUE        _U_(0x0000)  /**< \brief (PTC_CTRLB reset_value) Control B */

