Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
#define PTC_CTRLB_LEFTADJ_Pos       0            /**< \brief (PTC_CTRLB) Left-Adjusted Result */
#define PTC_CTRLB_LEFTADJ           (_U_(0x1) << PTC_CTRLB_LEFTADJ_Pos)
#define PTC_CTRLB_FREERUN_Pos       1            /**< \brief (PTC_CTRLB) Free Running Mode */
#define PTC_CTRLB_FREERUN           (_U_(0x1) << PTC_CTRLB_FREERUN_Pos)
#define PTC_CTRLB_CORREN_Pos        2            /**< \brief (PTC_CTRLB) Digital Correction Logic Enable */
#define PTC_CTRLB_CORREN            (_U_(0x1) << PTC_CTRLB_CORREN_Pos)
#define PTC_CTRLB_RESSEL_Pos        3            /**< \brief (PTC_CTRLB) Conversion Result Resolution */
#define PTC_CTRLB_RESSEL_Msk        (_U_(0x3) << PTC_CTRLB_RESSEL_Pos)
#define PTC_CTRLB_RESSEL(value)     (PTC_CTRLB_RESSEL_Msk & ((value) << PTC_CTRLB_RESSEL_Pos))
#define   PTC_CTRLB_RESSEL_12BIT_Val      _U_(0x0)   /**< \brief (PTC_CTRLB) 12-bit result */
#define   PTC_CTRLB_RESSEL_16BIT_Val      _U_(0x1)   /**< \brief (PTC_CTRLB) For averaging mode output */
#define   PTC_CTRLB_RESSEL_10BIT_Val      _U_(0x2)   /**< \brief (PTC_CTRLB) 10-bit result */
#define   PTC_CTRLB_RESSEL_8BIT_Val       _U_(0x3)   /**< \brief (PTC_CTRLB) 8-bit result */
#define PTC_CTRLB_RESSEL_12BIT      (PTC_CTRLB_RESSEL_12BIT_Val    << PTC_CTRLB_RESSEL_Pos)
#define PTC_CTRLB_RESSEL_16BIT      (PTC_CTRLB_RESSEL_16BIT_Val    << PTC_CTRLB_RESSEL_Pos)
#define PTC_CTRLB_RESSEL_10BIT      (PTC_CTRLB_RESSEL_10BIT_Val    << PTC_CTRLB_RESSEL_Pos)
#define PTC_CTRLB_RESSEL_8BIT       (PTC_CTRLB_RESSEL_8BIT_Val     << PTC_CTRLB_RESSEL_Pos)
#define PTC_CTRLB_WINMODE_Pos       8            /**< \brief (PTC_CTRLB) Window Monitor Mode */
#define PTC_CTRLB_WINMODE_Msk       (_U_(0x7) << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINMODE(value)    (PTC_CTRLB_WINMODE_Msk & ((value) << PTC_CTRLB_WINMODE_Pos))
#define   PTC_CTRLB_WINMODE_DISABLE_Val   _U_(0x0)   /**< \brief (PTC_CTRLB) No window mode (default) */
#define   PTC_CTRLB_WINMODE_MODE1_Val     _U_(0x1)   /**< \brief (PTC_CTRLB) RESULT > WINLT */
#define   PTC_CTRLB_WINMODE_MODE2_Val     _U_(0x2)   /**< \brief (PTC_CTRLB) RESULT < WINUT */
#define   PTC_CTRLB_WINMODE_MODE3_Val     _U_(0x3)   /**< \brief (PTC_CTRLB) WINLT < RESULT < WINUT */
#define   PTC_CTRLB_WINMODE_MODE4_Val     _U_(0x4)   /**< \brief (PTC_CTRLB) !(WINLT < RESULT < WINUT) */
#define PTC_CTRLB_WINMODE_DISABLE   (PTC_CTRLB_WINMODE_DISABLE_Val << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINMODE_MODE1     (PTC_CTRLB_WINMODE_MODE1_Val   << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINMODE_MODE2     (PTC_CTRLB_WINMODE_MODE2_Val   << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINMODE_MODE3     (PTC_CTRLB_WINMODE_MODE3_Val   << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINMODE_MODE4     (PTC_CTRLB_WINMODE_MODE4_Val   << PTC_CTRLB_WINMODE_Pos)
#define PTC_CTRLB_WINSS_Pos         11           /**< \brief (PTC_CTRLB) Window Single Sample */
#define PTC_CTRLB_WINSS             (_U_(0x1) << PTC_CTRLB_WINSS_Pos)
#define PTC_CTRLB_MASK              _U_(0x0F1F)  /**< \brief (PTC_CTRLB) MASK Register */

/* -------- PTC_REFCTRL : (PTC Offset: 0x08) (R/W  8) Reference Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  REFSEL:4;         /*!< bit:  0.. 3  Reference Selection                */
    uint8_t  :3;               /*!< bit:  4.. 6  Reserved                           */
    uint8_t  REFCOMP:1;        /*!< bit:      7  Reference Buffer Offset Compensation Enable */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_REFCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_REFCTRL_OFFSET          0x08         /**< \brief (PTC_REFCTRL offset) Reference Control */
#define PTC_REFCTRL_RESETVALUE      _U_(0x00)    /**< \brief (PTC_REFCTRL reset_value) Reference Control */

#define PTC_REFCTRL_REFSEL_Pos      0            /**< \brief (PTC_REFCTRL) Reference Selection */
#define PTC_REFCTRL_REFSEL_Msk      (_U_(0xF) << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL(value)   (PTC_REFCTRL_REFSEL_Msk & ((value) << PTC_REFCTRL_REFSEL_Pos))
#define   PTC_REFCTRL_REFSEL_INTREF_Val   _U_(0x0)   /**< \brief (PTC_REFCTRL) Internal Bandgap Reference */
#define   PTC_REFCTRL_REFSEL_INTVCC0_Val  _U_(0x2)   /**< \brief (PTC_REFCTRL) 1/2 VDDANA */
#define   PTC_REFCTRL_REFSEL_INTVCC1_Val  _U_(0x3)   /**< \brief (PTC_REFCTRL) VDDANA */
#define   PTC_REFCTRL_REFSEL_AREFA_Val    _U_(0x4)   /**< \brief (PTC_REFCTRL) External Reference */
#define   PTC_REFCTRL_REFSEL_AREFB_Val    _U_(0x5)   /**< \brief (PTC_REFCTRL) External Reference */
#define   PTC_REFCTRL_REFSEL_AREFC_Val    _U_(0x6)   /**< \brief (PTC_REFCTRL) External Reference (only on PTC1) */
#define PTC_REFCTRL_REFSEL_INTREF   (PTC_REFCTRL_REFSEL_INTREF_Val << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL_INTVCC0  (PTC_REFCTRL_REFSEL_INTVCC0_Val << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL_INTVCC1  (PTC_REFCTRL_REFSEL_INTVCC1_Val << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL_AREFA    (PTC_REFCTRL_REFSEL_AREFA_Val  << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL_AREFB    (PTC_REFCTRL_REFSEL_AREFB_Val  << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFSEL_AREFC    (PTC_REFCTRL_REFSEL_AREFC_Val  << PTC_REFCTRL_REFSEL_Pos)
#define PTC_REFCTRL_REFCOMP_Pos     7            /**< \brief (PTC_REFCTRL) Reference Buffer Offset Compensation Enable */
#define PTC_REFCTRL_REFCOMP         (_U_(0x1) << PTC_REFCTRL_REFCOMP_Pos)
#define PTC_REFCTRL_MASK            _U_(0x8F)    /**< \brief (PTC_REFCTRL) MASK Register */

/* -------- PTC_AVGCTRL : (PTC Offset: 0x0A) (R/W  8) Average Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SAMPLENUM:4;      /*!< bit:  0.. 3  Number of Samples to be Collected  */
    uint8_t  ADJRES:3;         /*!< bit:  4.. 6  Adjusting Result / Division Coefficient */
    uint8_t  :1;               /*!< bit:      7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_AVGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_AVGCTRL_OFFSET          0x0A         /**< \brief (PTC_AVGCTRL offset) Average Control */
#define PTC_AVGCTRL_RESETVALUE      _U_(0x00)    /**< \brief (PTC_AVGCTRL reset_value) Average Control */

#define PTC_AVGCTRL_SAMPLENUM_Pos   0            /**< \brief (PTC_AVGCTRL) Number of Samples to be Collected */
#define PTC_AVGCTRL_SAMPLENUM_Msk   (_U_(0xF) << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM(value) (PTC_AVGCTRL_SAMPLENUM_Msk & ((value) << PTC_AVGCTRL_SAMPLENUM_Pos))
#define   PTC_AVGCTRL_SAMPLENUM_1_Val     _U_(0x0)   /**< \brief (PTC_AVGCTRL) 1 sample */
#define   PTC_AVGCTRL_SAMPLENUM_2_Val     _U_(0x1)   /**< \brief (PTC_AVGCTRL) 2 samples */
#define   PTC_AVGCTRL_SAMPLENUM_4_Val     _U_(0x2)   /**< \brief (PTC_AVGCTRL) 4 samples */
#define   PTC_AVGCTRL_SAMPLENUM_8_Val     _U_(0x3)   /**< \brief (PTC_AVGCTRL) 8 samples */
#define   PTC_AVGCTRL_SAMPLENUM_16_Val    _U_(0x4)   /**< \brief (PTC_AVGCTRL) 16 samples */
#define   PTC_AVGCTRL_SAMPLENUM_32_Val    _U_(0x5)   /**< \brief (PTC_AVGCTRL) 32 samples */
#define   PTC_AVGCTRL_SAMPLENUM_64_Val    _U_(0x6)   /**< \brief (PTC_AVGCTRL) 64 samples */
#define   PTC_AVGCTRL_SAMPLENUM_128_Val   _U_(0x7)   /**< \brief (PTC_AVGCTRL) 128 samples */
#define   PTC_AVGCTRL_SAMPLENUM_256_Val   _U_(0x8)   /**< \brief (PTC_AVGCTRL) 256 samples */
#define   PTC_AVGCTRL_SAMPLENUM_512_Val   _U_(0x9)   /**< \brief (PTC_AVGCTRL) 512 samples */
#define   PTC_AVGCTRL_SAMPLENUM_1024_Val  _U_(0xA)   /**< \brief (PTC_AVGCTRL) 1024 samples */
#define PTC_AVGCTRL_SAMPLENUM_1     (PTC_AVGCTRL_SAMPLENUM_1_Val   << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_2     (PTC_AVGCTRL_SAMPLENUM_2_Val   << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_4     (PTC_AVGCTRL_SAMPLENUM_4_Val   << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_8     (PTC_AVGCTRL_SAMPLENUM_8_Val   << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_16    (PTC_AVGCTRL_SAMPLENUM_16_Val  << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_32    (PTC_AVGCTRL_SAMPLENUM_32_Val  << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_64    (PTC_AVGCTRL_SAMPLENUM_64_Val  << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_128   (PTC_AVGCTRL_SAMPLENUM_128_Val << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_256   (PTC_AVGCTRL_SAMPLENUM_256_Val << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_512   (PTC_AVGCTRL_SAMPLENUM_512_Val << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_SAMPLENUM_1024  (PTC_AVGCTRL_SAMPLENUM_1024_Val << PTC_AVGCTRL_SAMPLENUM_Pos)
#define PTC_AVGCTRL_ADJRES_Pos      4            /**< \brief (PTC_AVGCTRL) Adjusting Result / Division Coefficient */
#define PTC_AVGCTRL_ADJRES_Msk      (_U_(0x7) << PTC_AVGCTRL_ADJRES_Pos)
#define PTC_AVGCTRL_ADJRES(value)   (PTC_AVGCTRL_ADJRES_Msk & ((value) << PTC_AVGCTRL_ADJRES_Pos))
#define PTC_AVGCTRL_MASK            _U_(0x7F)    /**< \brief (PTC_AVGCTRL) MASK Register */

/* -------- PTC_SAMPCTRL : (PTC Offset: 0x0B) (R/W  8) Sample Time Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SAMPLEN:6;        /*!< bit:  0.. 5  Sampling Time Length               */
    uint8_t  :1;               /*!< bit:      6  Reserved                           */
    uint8_t  OFFCOMP:1;        /*!< bit:      7  Comparator Offset Compensation Enable */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_SAMPCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_SAMPCTRL_OFFSET         0x0B         /**< \brief (PTC_SAMPCTRL offset) Sample Time Control */
#define PTC_SAMPCTRL_RESETVALUE     _U_(0x00)    /**< \brief (PTC_SAMPCTRL reset_value) Sample Time Control */

#define PTC_SAMPCTRL_SAMPLEN_Pos    0            /**< \brief (PTC_SAMPCTRL) Sampling Time Length */
#define PTC_SAMPCTRL_SAMPLEN_Msk    (_U_(0x3F) << PTC_SAMPCTRL_SAMPLEN_Pos)
#define PTC_SAMPCTRL_SAMPLEN(value) (PTC_SAMPCTRL_SAMPLEN_Msk & ((value) << PTC_SAMPCTRL_SAMPLEN_Pos))
#define PTC_SAMPCTRL_OFFCOMP_Pos    7            /**< \brief (PTC_SAMPCTRL) Comparator Offset Compensation Enable */
#define PTC_SAMPCTRL_OFFCOMP        (_U_(0x1) << PTC_SAMPCTRL_OFFCOMP_Pos)
#define PTC_SAMPCTRL_MASK           _U_(0xBF)    /**< \brief (PTC_SAMPCTRL) MASK Register */

/* -------- PTC_WINLT : (PTC Offset: 0x0C) (R/W 16) Window Monitor Lower Threshold -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t WINLT:16;         /*!< bit:  0..15  Window Lower Threshold             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_WINLT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_WINLT_OFFSET            0x0C         /**< \brief (PTC_WINLT offset) Window Monitor Lower Threshold */
#define PTC_WINLT_RESETVALUE        _U_(0x0000)  /**< \brief (PTC_WINLT reset_value) Window Monitor Lower Threshold */

#define PTC_WINLT_WINLT_Pos         0            /**< \brief (PTC_WINLT) Window Lower Threshold */
#define PTC_WINLT_WINLT_Msk         (_U_(0xFFFF) << PTC_WINLT_WINLT_Pos)
#define PTC_WINLT_WINLT(value)      (PTC_WINLT_WINLT_Msk & ((value) << PTC_WINLT_WINLT_Pos))
#define PTC_WINLT_MASK              _U_(0xFFFF)  /**< \brief (PTC_WINLT) MASK Register */

/* -------- PTC_WINUT : (PTC Offset: 0x0E) (R/W 16) Window Monitor Upper Threshold -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t WINUT:16;         /*!< bit:  0..15  Window Upper Threshold             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_WINUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

