Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
#define PTC_WINUT_OFFSET            0x0E         /**< \brief (PTC_WINUT offset) Window Monitor Upper Threshold */
#define PTC_WINUT_RESETVALUE        _U_(0x0000)  /**< \brief (PTC_WINUT reset_value) Window Monitor Upper Threshold */

#define PTC_WINUT_WINUT_Pos         0            /**< \brief (PTC_WINUT) Window Upper Threshold */
#define PTC_WINUT_WINUT_Msk         (_U_(0xFFFF) << PTC_WINUT_WINUT_Pos)
#define PTC_WINUT_WINUT(value)      (PTC_WINUT_WINUT_Msk & ((value) << PTC_WINUT_WINUT_Pos))
#define PTC_WINUT_MASK              _U_(0xFFFF)  /**< \brief (PTC_WINUT) MASK Register */

/* -------- PTC_GAINCORR : (PTC Offset: 0x10) (R/W 16) Gain Correction -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t GAINCORR:12;      /*!< bit:  0..11  Gain Correction Value              */
    uint16_t :4;               /*!< bit: 12..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_GAINCORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_GAINCORR_OFFSET         0x10         /**< \brief (PTC_GAINCORR offset) Gain Correction */
#define PTC_GAINCORR_RESETVALUE     _U_(0x0000)  /**< \brief (PTC_GAINCORR reset_value) Gain Correction */

#define PTC_GAINCORR_GAINCORR_Pos   0            /**< \brief (PTC_GAINCORR) Gain Correction Value */
#define PTC_GAINCORR_GAINCORR_Msk   (_U_(0xFFF) << PTC_GAINCORR_GAINCORR_Pos)
#define PTC_GAINCORR_GAINCORR(value) (PTC_GAINCORR_GAINCORR_Msk & ((value) << PTC_GAINCORR_GAINCORR_Pos))
#define PTC_GAINCORR_MASK           _U_(0x0FFF)  /**< \brief (PTC_GAINCORR) MASK Register */

/* -------- PTC_OFFSETCORR : (PTC Offset: 0x12) (R/W 16) Offset Correction -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t OFFSETCORR:12;    /*!< bit:  0..11  Offset Correction Value            */
    uint16_t :4;               /*!< bit: 12..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_OFFSETCORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_OFFSETCORR_OFFSET       0x12         /**< \brief (PTC_OFFSETCORR offset) Offset Correction */
#define PTC_OFFSETCORR_RESETVALUE   _U_(0x0000)  /**< \brief (PTC_OFFSETCORR reset_value) Offset Correction */

#define PTC_OFFSETCORR_OFFSETCORR_Pos 0            /**< \brief (PTC_OFFSETCORR) Offset Correction Value */
#define PTC_OFFSETCORR_OFFSETCORR_Msk (_U_(0xFFF) << PTC_OFFSETCORR_OFFSETCORR_Pos)
#define PTC_OFFSETCORR_OFFSETCORR(value) (PTC_OFFSETCORR_OFFSETCORR_Msk & ((value) << PTC_OFFSETCORR_OFFSETCORR_Pos))
#define PTC_OFFSETCORR_MASK         _U_(0x0FFF)  /**< \brief (PTC_OFFSETCORR) MASK Register */

/* -------- PTC_SWTRIG : (PTC Offset: 0x14) (R/W  8) Software Trigger -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  FLUSH:1;          /*!< bit:      0  PTC Conversion Flush               */
    uint8_t  START:1;          /*!< bit:      1  Start PTC Conversion               */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_SWTRIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_SWTRIG_OFFSET           0x14         /**< \brief (PTC_SWTRIG offset) Software Trigger */
#define PTC_SWTRIG_RESETVALUE       _U_(0x00)    /**< \brief (PTC_SWTRIG reset_value) Software Trigger */

#define PTC_SWTRIG_FLUSH_Pos        0            /**< \brief (PTC_SWTRIG) PTC Conversion Flush */
#define PTC_SWTRIG_FLUSH            (_U_(0x1) << PTC_SWTRIG_FLUSH_Pos)
#define PTC_SWTRIG_START_Pos        1            /**< \brief (PTC_SWTRIG) Start PTC Conversion */
#define PTC_SWTRIG_START            (_U_(0x1) << PTC_SWTRIG_START_Pos)
#define PTC_SWTRIG_MASK             _U_(0x03)    /**< \brief (PTC_SWTRIG) MASK Register */
/* -------- PTC_CTRLC : (PTC Offset: 0x18) (R/W 32) Control C -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
	struct {
		uint32_t CTSM:4;           /*!< bit:  0.. 3  Capacitive Touch Sensing Mode      */
		uint32_t DRIVERSEL:2;      /*!< bit:  4.. 5  Driver Selection                   */
		uint32_t RSCEN:1;          /*!< bit:      6  Reduced Self-Cap Enable            */
		uint32_t :1;               /*!< bit:      7  Reserved                           */
		uint32_t SDS:4;            /*!< bit:  8..11  Sampling Delay Selection           */
		uint32_t ASDV:1;           /*!< bit:     12  Automatic Sampling Delay Variation */
		uint32_t CCDS:2;           /*!< bit: 13..14  Channel Change Delay Selection     */
		uint32_t :5;               /*!< bit: 15..19  Reserved                           */
		uint32_t RSEL:3;           /*!< bit: 20..22  Resistor Selection                 */
		uint32_t :9;               /*!< bit: 23..31  Reserved                           */
		} bit;                       /*!< Structure used for bit  access                  */
		uint32_t reg;                /*!< Type      used for register access              */
	} PTC_CTRLC_Type;
	#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

	#define PTC_CTRLC_OFFSET            0x18         /**< \brief (PTC_CTRLC offset) Control C */
	#define PTC_CTRLC_RESETVALUE        _U(0x00000000); /**< \brief (PTC_CTRLC reset_value) Control C */

	#define PTC_CTRLC_CTSM_Pos          0            /**< \brief (PTC_CTRLC) Capacitive Touch Sensing Mode */
	#define PTC_CTRLC_CTSM_Msk          (_U(0xF) << PTC_CTRLC_CTSM_Pos)
	#define PTC_CTRLC_CTSM(value)       (PTC_CTRLC_CTSM_Msk & ((value) << PTC_CTRLC_CTSM_Pos))
	#define PTC_CTRLC_DRIVERSEL_Pos     4            /**< \brief (PTC_CTRLC) Driver Selection */
	#define PTC_CTRLC_DRIVERSEL_Msk     (_U(0x3) << PTC_CTRLC_DRIVERSEL_Pos)
	#define PTC_CTRLC_DRIVERSEL(value)  (PTC_CTRLC_DRIVERSEL_Msk & ((value) << PTC_CTRLC_DRIVERSEL_Pos))
	#define   PTC_CTRLC_DRIVERSEL_LINEDRV_Val _U(0x0)   /**< \brief (PTC_CTRLC) Individual digital drivers */
	#define   PTC_CTRLC_DRIVERSEL_LARGEDRV_Val _U(0x1)   /**< \brief (PTC_CTRLC) Large digital driver (selfcap mode only) */
	#define   PTC_CTRLC_DRIVERSEL_PADDRV_Val  _U(0x3)   /**< \brief (PTC_CTRLC) Pads drivers */
	#define PTC_CTRLC_DRIVERSEL_LINEDRV (PTC_CTRLC_DRIVERSEL_LINEDRV_Val << PTC_CTRLC_DRIVERSEL_Pos)
	#define PTC_CTRLC_DRIVERSEL_LARGEDRV (PTC_CTRLC_DRIVERSEL_LARGEDRV_Val << PTC_CTRLC_DRIVERSEL_Pos)
	#define PTC_CTRLC_DRIVERSEL_PADDRV  (PTC_CTRLC_DRIVERSEL_PADDRV_Val << PTC_CTRLC_DRIVERSEL_Pos)
	#define PTC_CTRLC_RSCEN_Pos         6            /**< \brief (PTC_CTRLC) Reduced Self-Cap Enable */
	#define PTC_CTRLC_RSCEN             (_U(0x1) << PTC_CTRLC_RSCEN_Pos)
	#define PTC_CTRLC_SDS_Pos           8            /**< \brief (PTC_CTRLC) Sampling Delay Selection */
	#define PTC_CTRLC_SDS_Msk           (_U(0xF) << PTC_CTRLC_SDS_Pos)
	#define PTC_CTRLC_SDS(value)        (PTC_CTRLC_SDS_Msk & ((value) << PTC_CTRLC_SDS_Pos))
	#define PTC_CTRLC_ASDV_Pos          12           /**< \brief (PTC_CTRLC) Automatic Sampling Delay Variation */
	#define PTC_CTRLC_ASDV              (_U(0x1) << PTC_CTRLC_ASDV_Pos)
	#define PTC_CTRLC_CCDS_Pos          13           /**< \brief (PTC_CTRLC) Channel Change Delay Selection */
	#define PTC_CTRLC_CCDS_Msk          (_U(0x3) << PTC_CTRLC_CCDS_Pos)
	#define PTC_CTRLC_CCDS(value)       (PTC_CTRLC_CCDS_Msk & ((value) << PTC_CTRLC_CCDS_Pos))
	#define PTC_CTRLC_RSEL_Pos          20           /**< \brief (PTC_CTRLC) Resistor Selection */
	#define PTC_CTRLC_RSEL_Msk          (_U(0x7) << PTC_CTRLC_RSEL_Pos)
	#define PTC_CTRLC_RSEL(value)       (PTC_CTRLC_RSEL_Msk & ((value) << PTC_CTRLC_RSEL_Pos))
	#define PTC_CTRLC_MASK              _U(0x00707F7F) /**< \brief (PTC_CTRLC) MASK Register */

	/* -------- PTC_CTRLD : (PTC Offset: 0x1C) (R/W 32) Control D -------- */
	#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
	typedef union {
		struct {
			uint32_t CCA:4;            /*!< bit:  0.. 3  Compensation Capacitor Accurate Value */
			uint32_t CCF:4;            /*!< bit:  4.. 7  Compensation Capacitor Fine Value  */
			uint32_t CCC:4;            /*!< bit:  8..11  Compensation Capacitor Coarse Value */
			uint32_t CCR:2;            /*!< bit: 12..13  Compensation Capacitor Rough Value */
			uint32_t :2;               /*!< bit: 14..15  Reserved                           */
			uint32_t CIF:4;            /*!< bit: 16..19  Integration Capacitor Fine Value   */
			uint32_t CIC:2;            /*!< bit: 20..21  Integration Capacitor Coarse Value */
			uint32_t :10;              /*!< bit: 22..31  Reserved                           */
			} bit;                       /*!< Structure used for bit  access                  */
			uint32_t reg;                /*!< Type      used for register access              */
		} PTC_CTRLD_Type;
		#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

		#define PTC_CTRLD_OFFSET            0x1C         /**< \brief (PTC_CTRLD offset) Control D */
		#define PTC_CTRLD_RESETVALUE        _U(0x00000000); /**< \brief (PTC_CTRLD reset_value) Control D */

		#define PTC_CTRLD_CCA_Pos           0            /**< \brief (PTC_CTRLD) Compensation Capacitor Accurate Value */
		#define PTC_CTRLD_CCA_Msk           (_U(0xF) << PTC_CTRLD_CCA_Pos)
		#define PTC_CTRLD_CCA(value)        (PTC_CTRLD_CCA_Msk & ((value) << PTC_CTRLD_CCA_Pos))
		#define PTC_CTRLD_CCF_Pos           4            /**< \brief (PTC_CTRLD) Compensation Capacitor Fine Value */
		#define PTC_CTRLD_CCF_Msk           (_U(0xF) << PTC_CTRLD_CCF_Pos)
		#define PTC_CTRLD_CCF(value)        (PTC_CTRLD_CCF_Msk & ((value) << PTC_CTRLD_CCF_Pos))
		#define PTC_CTRLD_CCC_Pos           8            /**< \brief (PTC_CTRLD) Compensation Capacitor Coarse Value */
		#define PTC_CTRLD_CCC_Msk           (_U(0xF) << PTC_CTRLD_CCC_Pos)
		#define PTC_CTRLD_CCC(value)        (PTC_CTRLD_CCC_Msk & ((value) << PTC_CTRLD_CCC_Pos))
		#define PTC_CTRLD_CCR_Pos           12           /**< \brief (PTC_CTRLD) Compensation Capacitor Rough Value */
		#define PTC_CTRLD_CCR_Msk           (_U(0x3) << PTC_CTRLD_CCR_Pos)
		#define PTC_CTRLD_CCR(value)        (PTC_CTRLD_CCR_Msk & ((value) << PTC_CTRLD_CCR_Pos))
		#define PTC_CTRLD_CIF_Pos           16           /**< \brief (PTC_CTRLD) Integration Capacitor Fine Value */
		#define PTC_CTRLD_CIF_Msk           (_U(0xF) << PTC_CTRLD_CIF_Pos)
		#define PTC_CTRLD_CIF(value)        (PTC_CTRLD_CIF_Msk & ((value) << PTC_CTRLD_CIF_Pos))
		#define PTC_CTRLD_CIC_Pos           20           /**< \brief (PTC_CTRLD) Integration Capacitor Coarse Value */
		#define PTC_CTRLD_CIC_Msk           (_U(0x3) << PTC_CTRLD_CIC_Pos)
		#define PTC_CTRLD_CIC(value)        (PTC_CTRLD_CIC_Msk & ((value) << PTC_CTRLD_CIC_Pos))
		#define PTC_CTRLD_MASK              _U(0x003F3FFF) /**< \brief (PTC_CTRLD) MASK Register */

		/* -------- PTC_PINEN : (PTC Offset: 0x20) (R/W 32) Pin Touch Enable -------- */
		#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
		typedef union {
			struct {
				uint32_t PINEN:32;         /*!< bit:  0..31  Touch line Enable                  */
				} bit;                       /*!< Structure used for bit  access                  */
				uint32_t reg;                /*!< Type      used for register access              */
			} PTC_PINEN_Type;
			#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

			#define PTC_PINEN_OFFSET            0x20         /**< \brief (PTC_PINEN offset) Pin Touch Enable */
			#define PTC_PINEN_RESETVALUE        _U(0x00000000); /**< \brief (PTC_PINEN reset_value) Pin Touch Enable */

			#define PTC_PINEN_PINEN_Pos         0            /**< \brief (PTC_PINEN) Touch line Enable */
			#define PTC_PINEN_PINEN_Msk         (_U(0xFFFFFFFF) << PTC_PINEN_PINEN_Pos)
			#define PTC_PINEN_PINEN(value)      (PTC_PINEN_PINEN_Msk & ((value) << PTC_PINEN_PINEN_Pos))
			#define PTC_PINEN_MASK              _U(0xFFFFFFFF) /**< \brief (PTC_PINEN) MASK Register */

			/* -------- PTC_XSEL : (PTC Offset: 0x24) (R/W 32) X-lines Selection -------- */
			#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
			typedef union {
				struct {
					uint32_t XSEL:32;          /*!< bit:  0..31  X-lines Selection                  */
					} bit;                       /*!< Structure used for bit  access                  */
					uint32_t reg;                /*!< Type      used for register access              */
				} PTC_XSEL_Type;
				#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

				#define PTC_XSEL_OFFSET             0x24         /**< \brief (PTC_XSEL offset) X-lines Selection */
				#define PTC_XSEL_RESETVALUE         _U(0x00000000); /**< \brief (PTC_XSEL reset_value) X-lines Selection */

				#define PTC_XSEL_XSEL_Pos           0            /**< \brief (PTC_XSEL) X-lines Selection */
				#define PTC_XSEL_XSEL_Msk           (_U(0xFFFFFFFF) << PTC_XSEL_XSEL_Pos)
				#define PTC_XSEL_XSEL(value)        (PTC_XSEL_XSEL_Msk & ((value) << PTC_XSEL_XSEL_Pos))
				#define PTC_XSEL_MASK               _U(0xFFFFFFFF) /**< \brief (PTC_XSEL) MASK Register */

				/* -------- PTC_YSEL : (PTC Offset: 0x28) (R/W 32) Y-lines Selection -------- */
				#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
				typedef union {
					struct {
						uint32_t YSEL:32;          /*!< bit:  0..31  Y-line Selection                   */
						} bit;                       /*!< Structure used for bit  access                  */
						uint32_t reg;                /*!< Type      used for register access              */
					} PTC_YSEL_Type;
					#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

