Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
					#define PTC_YSEL_OFFSET             0x28         /**< \brief (PTC_YSEL offset) Y-lines Selection */
					#define PTC_YSEL_RESETVALUE         _U(0x00000000); /**< \brief (PTC_YSEL reset_value) Y-lines Selection */

					#define PTC_YSEL_YSEL_Pos           0            /**< \brief (PTC_YSEL) Y-line Selection */
					#define PTC_YSEL_YSEL_Msk           (_U(0xFFFFFFFF) << PTC_YSEL_YSEL_Pos)
					#define PTC_YSEL_YSEL(value)        (PTC_YSEL_YSEL_Msk & ((value) << PTC_YSEL_YSEL_Pos))
					#define PTC_YSEL_MASK               _U(0xFFFFFFFF) /**< \brief (PTC_YSEL) MASK Register */
/* -------- PTC_INTENCLR : (PTC Offset: 0x2C) (R/W  8) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  RESRDY:1;         /*!< bit:      0  Result Ready Interrupt Disable     */
    uint8_t  OVERRUN:1;        /*!< bit:      1  Overrun Interrupt Disable          */
    uint8_t  WINMON:1;         /*!< bit:      2  Window Monitor Interrupt Disable   */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTENCLR_OFFSET         0x2C         /**< \brief (PTC_INTENCLR offset) Interrupt Enable Clear */
#define PTC_INTENCLR_RESETVALUE     _U_(0x00)    /**< \brief (PTC_INTENCLR reset_value) Interrupt Enable Clear */

#define PTC_INTENCLR_RESRDY_Pos     0            /**< \brief (PTC_INTENCLR) Result Ready Interrupt Disable */
#define PTC_INTENCLR_RESRDY         (_U_(0x1) << PTC_INTENCLR_RESRDY_Pos)
#define PTC_INTENCLR_OVERRUN_Pos    1            /**< \brief (PTC_INTENCLR) Overrun Interrupt Disable */
#define PTC_INTENCLR_OVERRUN        (_U_(0x1) << PTC_INTENCLR_OVERRUN_Pos)
#define PTC_INTENCLR_WINMON_Pos     2            /**< \brief (PTC_INTENCLR) Window Monitor Interrupt Disable */
#define PTC_INTENCLR_WINMON         (_U_(0x1) << PTC_INTENCLR_WINMON_Pos)
#define PTC_INTENCLR_MASK           _U_(0x07)    /**< \brief (PTC_INTENCLR) MASK Register */

/* -------- PTC_INTENSET : (PTC Offset: 0x2D) (R/W  8) Interrupt Enable Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  RESRDY:1;         /*!< bit:      0  Result Ready Interrupt Enable      */
    uint8_t  OVERRUN:1;        /*!< bit:      1  Overrun Interrupt Enable           */
    uint8_t  WINMON:1;         /*!< bit:      2  Window Monitor Interrupt Enable    */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTENSET_OFFSET         0x2D         /**< \brief (PTC_INTENSET offset) Interrupt Enable Set */
#define PTC_INTENSET_RESETVALUE     _U_(0x00)    /**< \brief (PTC_INTENSET reset_value) Interrupt Enable Set */

#define PTC_INTENSET_RESRDY_Pos     0            /**< \brief (PTC_INTENSET) Result Ready Interrupt Enable */
#define PTC_INTENSET_RESRDY         (_U_(0x1) << PTC_INTENSET_RESRDY_Pos)
#define PTC_INTENSET_OVERRUN_Pos    1            /**< \brief (PTC_INTENSET) Overrun Interrupt Enable */
#define PTC_INTENSET_OVERRUN        (_U_(0x1) << PTC_INTENSET_OVERRUN_Pos)
#define PTC_INTENSET_WINMON_Pos     2            /**< \brief (PTC_INTENSET) Window Monitor Interrupt Enable */
#define PTC_INTENSET_WINMON         (_U_(0x1) << PTC_INTENSET_WINMON_Pos)
#define PTC_INTENSET_MASK           _U_(0x07)    /**< \brief (PTC_INTENSET) MASK Register */

/* -------- PTC_INTFLAG : (PTC Offset: 0x2E) (R/W  8) Interrupt Flag Status and Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { // __I to avoid read-modify-write on write-to-clear register
  struct {
    __I uint8_t  RESRDY:1;         /*!< bit:      0  Result Ready Interrupt Flag        */
    __I uint8_t  OVERRUN:1;        /*!< bit:      1  Overrun Interrupt Flag             */
    __I uint8_t  WINMON:1;         /*!< bit:      2  Window Monitor Interrupt Flag      */
    __I uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_INTFLAG_OFFSET          0x2E         /**< \brief (PTC_INTFLAG offset) Interrupt Flag Status and Clear */
#define PTC_INTFLAG_RESETVALUE      _U_(0x00)    /**< \brief (PTC_INTFLAG reset_value) Interrupt Flag Status and Clear */

#define PTC_INTFLAG_RESRDY_Pos      0            /**< \brief (PTC_INTFLAG) Result Ready Interrupt Flag */
#define PTC_INTFLAG_RESRDY          (_U_(0x1) << PTC_INTFLAG_RESRDY_Pos)
#define PTC_INTFLAG_OVERRUN_Pos     1            /**< \brief (PTC_INTFLAG) Overrun Interrupt Flag */
#define PTC_INTFLAG_OVERRUN         (_U_(0x1) << PTC_INTFLAG_OVERRUN_Pos)
#define PTC_INTFLAG_WINMON_Pos      2            /**< \brief (PTC_INTFLAG) Window Monitor Interrupt Flag */
#define PTC_INTFLAG_WINMON          (_U_(0x1) << PTC_INTFLAG_WINMON_Pos)
#define PTC_INTFLAG_MASK            _U_(0x07)    /**< \brief (PTC_INTFLAG) MASK Register */

/* -------- PTC_STATUS : (PTC Offset: 0x2F) (R/   8) Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  PTCBUSY:1;        /*!< bit:      0  PTC Busy Status                    */
    uint8_t  :1;               /*!< bit:      1  Reserved                           */
    uint8_t  WCC:6;            /*!< bit:  2.. 7  Window Comparator Counter          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

