Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
#define PTC_STATUS_OFFSET           0x2F         /**< \brief (PTC_STATUS offset) Status */
#define PTC_STATUS_RESETVALUE       _U_(0x00)    /**< \brief (PTC_STATUS reset_value) Status */

#define PTC_STATUS_PTCBUSY_Pos      0            /**< \brief (PTC_STATUS) PTC Busy Status */
#define PTC_STATUS_PTCBUSY          (_U_(0x1) << PTC_STATUS_PTCBUSY_Pos)
#define PTC_STATUS_WCC_Pos          2            /**< \brief (PTC_STATUS) Window Comparator Counter */
#define PTC_STATUS_WCC_Msk          (_U_(0x3F) << PTC_STATUS_WCC_Pos)
#define PTC_STATUS_WCC(value)       (PTC_STATUS_WCC_Msk & ((value) << PTC_STATUS_WCC_Pos))
#define PTC_STATUS_MASK             _U_(0xFD)    /**< \brief (PTC_STATUS) MASK Register */

/* -------- PTC_SYNCBUSY : (PTC Offset: 0x30) (R/  32) Synchronization Busy -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  SWRST Synchronization Busy         */
    uint32_t ENABLE:1;         /*!< bit:      1  ENABLE Synchronization Busy        */
    uint32_t INPUTCTRL:1;      /*!< bit:      2  Input Control Synchronization Busy */
    uint32_t CTRLB:1;          /*!< bit:      3  Control B Synchronization Busy     */
    uint32_t REFCTRL:1;        /*!< bit:      4  Reference Control Synchronization Busy */
    uint32_t AVGCTRL:1;        /*!< bit:      5  Average Control Synchronization Busy */
    uint32_t SAMPCTRL:1;       /*!< bit:      6  Sampling Time Control Synchronization Busy */
    uint32_t WINLT:1;          /*!< bit:      7  Window Monitor Lower Threshold Synchronization Busy */
    uint32_t WINUT:1;          /*!< bit:      8  Window Monitor Upper Threshold Synchronization Busy */
    uint32_t GAINCORR:1;       /*!< bit:      9  Gain Correction Synchronization Busy */
    uint32_t OFFSETCORR:1;     /*!< bit:     10  Offset Correction Synchronization Busy */
    uint32_t SWTRIG:1;         /*!< bit:     11  Software Trigger Synchronization Busy */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PTC_SYNCBUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_SYNCBUSY_OFFSET         0x30         /**< \brief (PTC_SYNCBUSY offset) Synchronization Busy */
#define PTC_SYNCBUSY_RESETVALUE     _U_(0x00000000) /**< \brief (PTC_SYNCBUSY reset_value) Synchronization Busy */

#define PTC_SYNCBUSY_SWRST_Pos      0            /**< \brief (PTC_SYNCBUSY) SWRST Synchronization Busy */
#define PTC_SYNCBUSY_SWRST          (_U_(0x1) << PTC_SYNCBUSY_SWRST_Pos)
#define PTC_SYNCBUSY_ENABLE_Pos     1            /**< \brief (PTC_SYNCBUSY) ENABLE Synchronization Busy */
#define PTC_SYNCBUSY_ENABLE         (_U_(0x1) << PTC_SYNCBUSY_ENABLE_Pos)
#define PTC_SYNCBUSY_INPUTCTRL_Pos  2            /**< \brief (PTC_SYNCBUSY) Input Control Synchronization Busy */
#define PTC_SYNCBUSY_INPUTCTRL      (_U_(0x1) << PTC_SYNCBUSY_INPUTCTRL_Pos)
#define PTC_SYNCBUSY_CTRLB_Pos      3            /**< \brief (PTC_SYNCBUSY) Control B Synchronization Busy */
#define PTC_SYNCBUSY_CTRLB          (_U_(0x1) << PTC_SYNCBUSY_CTRLB_Pos)
#define PTC_SYNCBUSY_REFCTRL_Pos    4            /**< \brief (PTC_SYNCBUSY) Reference Control Synchronization Busy */
#define PTC_SYNCBUSY_REFCTRL        (_U_(0x1) << PTC_SYNCBUSY_REFCTRL_Pos)
#define PTC_SYNCBUSY_AVGCTRL_Pos    5            /**< \brief (PTC_SYNCBUSY) Average Control Synchronization Busy */
#define PTC_SYNCBUSY_AVGCTRL        (_U_(0x1) << PTC_SYNCBUSY_AVGCTRL_Pos)
#define PTC_SYNCBUSY_SAMPCTRL_Pos   6            /**< \brief (PTC_SYNCBUSY) Sampling Time Control Synchronization Busy */
#define PTC_SYNCBUSY_SAMPCTRL       (_U_(0x1) << PTC_SYNCBUSY_SAMPCTRL_Pos)
#define PTC_SYNCBUSY_WINLT_Pos      7            /**< \brief (PTC_SYNCBUSY) Window Monitor Lower Threshold Synchronization Busy */
#define PTC_SYNCBUSY_WINLT          (_U_(0x1) << PTC_SYNCBUSY_WINLT_Pos)
#define PTC_SYNCBUSY_WINUT_Pos      8            /**< \brief (PTC_SYNCBUSY) Window Monitor Upper Threshold Synchronization Busy */
#define PTC_SYNCBUSY_WINUT          (_U_(0x1) << PTC_SYNCBUSY_WINUT_Pos)
#define PTC_SYNCBUSY_GAINCORR_Pos   9            /**< \brief (PTC_SYNCBUSY) Gain Correction Synchronization Busy */
#define PTC_SYNCBUSY_GAINCORR       (_U_(0x1) << PTC_SYNCBUSY_GAINCORR_Pos)
#define PTC_SYNCBUSY_OFFSETCORR_Pos 10           /**< \brief (PTC_SYNCBUSY) Offset Correction Synchronization Busy */
#define PTC_SYNCBUSY_OFFSETCORR     (_U_(0x1) << PTC_SYNCBUSY_OFFSETCORR_Pos)
#define PTC_SYNCBUSY_SWTRIG_Pos     11           /**< \brief (PTC_SYNCBUSY) Software Trigger Synchronization Busy */
#define PTC_SYNCBUSY_SWTRIG         (_U_(0x1) << PTC_SYNCBUSY_SWTRIG_Pos)
#define PTC_SYNCBUSY_MASK           _U_(0x00000FFF) /**< \brief (PTC_SYNCBUSY) MASK Register */

/* -------- PTC_DSEQDATA : (PTC Offset: 0x34) ( /W 32) DMA Sequencial Data -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  DMA Sequential Data                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PTC_DSEQDATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_DSEQDATA_OFFSET         0x34         /**< \brief (PTC_DSEQDATA offset) DMA Sequencial Data */
#define PTC_DSEQDATA_RESETVALUE     _U_(0x00000000) /**< \brief (PTC_DSEQDATA reset_value) DMA Sequencial Data */

#define PTC_DSEQDATA_DATA_Pos       0            /**< \brief (PTC_DSEQDATA) DMA Sequential Data */
#define PTC_DSEQDATA_DATA_Msk       (_U_(0xFFFFFFFF) << PTC_DSEQDATA_DATA_Pos)
#define PTC_DSEQDATA_DATA(value)    (PTC_DSEQDATA_DATA_Msk & ((value) << PTC_DSEQDATA_DATA_Pos))
#define PTC_DSEQDATA_MASK           _U_(0xFFFFFFFF) /**< \brief (PTC_DSEQDATA) MASK Register */

