Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
/* -------- PTC_DSEQCTRL : (PTC Offset: 0x38) (R/W 32) DMA Sequential Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INPUTCTRL:1;      /*!< bit:      0  Input Control                      */
    uint32_t CTRLB:1;          /*!< bit:      1  Control B                          */
    uint32_t REFCTRL:1;        /*!< bit:      2  Reference Control                  */
    uint32_t AVGCTRL:1;        /*!< bit:      3  Average Control                    */
    uint32_t SAMPCTRL:1;       /*!< bit:      4  Sampling Time Control              */
    uint32_t WINLT:1;          /*!< bit:      5  Window Monitor Lower Threshold     */
    uint32_t WINUT:1;          /*!< bit:      6  Window Monitor Upper Threshold     */
    uint32_t GAINCORR:1;       /*!< bit:      7  Gain Correction                    */
    uint32_t OFFSETCORR:1;     /*!< bit:      8  Offset Correction                  */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AUTOSTART:1;      /*!< bit:     31  PTC Auto-Start Conversion          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PTC_DSEQCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_DSEQCTRL_OFFSET         0x38         /**< \brief (PTC_DSEQCTRL offset) DMA Sequential Control */
#define PTC_DSEQCTRL_RESETVALUE     _U_(0x00000000) /**< \brief (PTC_DSEQCTRL reset_value) DMA Sequential Control */

#define PTC_DSEQCTRL_INPUTCTRL_Pos  0            /**< \brief (PTC_DSEQCTRL) Input Control */
#define PTC_DSEQCTRL_INPUTCTRL      (_U_(0x1) << PTC_DSEQCTRL_INPUTCTRL_Pos)
#define PTC_DSEQCTRL_CTRLB_Pos      1            /**< \brief (PTC_DSEQCTRL) Control B */
#define PTC_DSEQCTRL_CTRLB          (_U_(0x1) << PTC_DSEQCTRL_CTRLB_Pos)
#define PTC_DSEQCTRL_REFCTRL_Pos    2            /**< \brief (PTC_DSEQCTRL) Reference Control */
#define PTC_DSEQCTRL_REFCTRL        (_U_(0x1) << PTC_DSEQCTRL_REFCTRL_Pos)
#define PTC_DSEQCTRL_AVGCTRL_Pos    3            /**< \brief (PTC_DSEQCTRL) Average Control */
#define PTC_DSEQCTRL_AVGCTRL        (_U_(0x1) << PTC_DSEQCTRL_AVGCTRL_Pos)
#define PTC_DSEQCTRL_SAMPCTRL_Pos   4            /**< \brief (PTC_DSEQCTRL) Sampling Time Control */
#define PTC_DSEQCTRL_SAMPCTRL       (_U_(0x1) << PTC_DSEQCTRL_SAMPCTRL_Pos)
#define PTC_DSEQCTRL_WINLT_Pos      5            /**< \brief (PTC_DSEQCTRL) Window Monitor Lower Threshold */
#define PTC_DSEQCTRL_WINLT          (_U_(0x1) << PTC_DSEQCTRL_WINLT_Pos)
#define PTC_DSEQCTRL_WINUT_Pos      6            /**< \brief (PTC_DSEQCTRL) Window Monitor Upper Threshold */
#define PTC_DSEQCTRL_WINUT          (_U_(0x1) << PTC_DSEQCTRL_WINUT_Pos)
#define PTC_DSEQCTRL_GAINCORR_Pos   7            /**< \brief (PTC_DSEQCTRL) Gain Correction */
#define PTC_DSEQCTRL_GAINCORR       (_U_(0x1) << PTC_DSEQCTRL_GAINCORR_Pos)
#define PTC_DSEQCTRL_OFFSETCORR_Pos 8            /**< \brief (PTC_DSEQCTRL) Offset Correction */
#define PTC_DSEQCTRL_OFFSETCORR     (_U_(0x1) << PTC_DSEQCTRL_OFFSETCORR_Pos)
#define PTC_DSEQCTRL_AUTOSTART_Pos  31           /**< \brief (PTC_DSEQCTRL) PTC Auto-Start Conversion */
#define PTC_DSEQCTRL_AUTOSTART      (_U_(0x1) << PTC_DSEQCTRL_AUTOSTART_Pos)
#define PTC_DSEQCTRL_MASK           _U_(0x800001FF) /**< \brief (PTC_DSEQCTRL) MASK Register */

/* -------- PTC_DSEQSTAT : (PTC Offset: 0x3C) (R/  32) DMA Sequencial Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INPUTCTRL:1;      /*!< bit:      0  Input Control                      */
    uint32_t CTRLB:1;          /*!< bit:      1  Control B                          */
    uint32_t REFCTRL:1;        /*!< bit:      2  Reference Control                  */
    uint32_t AVGCTRL:1;        /*!< bit:      3  Average Control                    */
    uint32_t SAMPCTRL:1;       /*!< bit:      4  Sampling Time Control              */
    uint32_t WINLT:1;          /*!< bit:      5  Window Monitor Lower Threshold     */
    uint32_t WINUT:1;          /*!< bit:      6  Window Monitor Upper Threshold     */
    uint32_t GAINCORR:1;       /*!< bit:      7  Gain Correction                    */
    uint32_t OFFSETCORR:1;     /*!< bit:      8  Offset Correction                  */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t BUSY:1;           /*!< bit:     31  DMA Sequencing Busy                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PTC_DSEQSTAT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_DSEQSTAT_OFFSET         0x3C         /**< \brief (PTC_DSEQSTAT offset) DMA Sequencial Status */
#define PTC_DSEQSTAT_RESETVALUE     _U_(0x00000000) /**< \brief (PTC_DSEQSTAT reset_value) DMA Sequencial Status */

#define PTC_DSEQSTAT_INPUTCTRL_Pos  0            /**< \brief (PTC_DSEQSTAT) Input Control */
#define PTC_DSEQSTAT_INPUTCTRL      (_U_(0x1) << PTC_DSEQSTAT_INPUTCTRL_Pos)
#define PTC_DSEQSTAT_CTRLB_Pos      1            /**< \brief (PTC_DSEQSTAT) Control B */
#define PTC_DSEQSTAT_CTRLB          (_U_(0x1) << PTC_DSEQSTAT_CTRLB_Pos)
#define PTC_DSEQSTAT_REFCTRL_Pos    2            /**< \brief (PTC_DSEQSTAT) Reference Control */
#define PTC_DSEQSTAT_REFCTRL        (_U_(0x1) << PTC_DSEQSTAT_REFCTRL_Pos)
#define PTC_DSEQSTAT_AVGCTRL_Pos    3            /**< \brief (PTC_DSEQSTAT) Average Control */
#define PTC_DSEQSTAT_AVGCTRL        (_U_(0x1) << PTC_DSEQSTAT_AVGCTRL_Pos)
#define PTC_DSEQSTAT_SAMPCTRL_Pos   4            /**< \brief (PTC_DSEQSTAT) Sampling Time Control */
#define PTC_DSEQSTAT_SAMPCTRL       (_U_(0x1) << PTC_DSEQSTAT_SAMPCTRL_Pos)
#define PTC_DSEQSTAT_WINLT_Pos      5            /**< \brief (PTC_DSEQSTAT) Window Monitor Lower Threshold */
#define PTC_DSEQSTAT_WINLT          (_U_(0x1) << PTC_DSEQSTAT_WINLT_Pos)
#define PTC_DSEQSTAT_WINUT_Pos      6            /**< \brief (PTC_DSEQSTAT) Window Monitor Upper Threshold */
#define PTC_DSEQSTAT_WINUT          (_U_(0x1) << PTC_DSEQSTAT_WINUT_Pos)
#define PTC_DSEQSTAT_GAINCORR_Pos   7            /**< \brief (PTC_DSEQSTAT) Gain Correction */
#define PTC_DSEQSTAT_GAINCORR       (_U_(0x1) << PTC_DSEQSTAT_GAINCORR_Pos)
#define PTC_DSEQSTAT_OFFSETCORR_Pos 8            /**< \brief (PTC_DSEQSTAT) Offset Correction */
#define PTC_DSEQSTAT_OFFSETCORR     (_U_(0x1) << PTC_DSEQSTAT_OFFSETCORR_Pos)
#define PTC_DSEQSTAT_BUSY_Pos       31           /**< \brief (PTC_DSEQSTAT) DMA Sequencing Busy */
#define PTC_DSEQSTAT_BUSY           (_U_(0x1) << PTC_DSEQSTAT_BUSY_Pos)
#define PTC_DSEQSTAT_MASK           _U_(0x800001FF) /**< \brief (PTC_DSEQSTAT) MASK Register */

/* -------- PTC_RESULT : (PTC Offset: 0x40) (R/  16) Result Conversion Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t RESULT:16;        /*!< bit:  0..15  Result Conversion Value            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_RESULT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_RESULT_OFFSET           0x40         /**< \brief (PTC_RESULT offset) Result Conversion Value */
#define PTC_RESULT_RESETVALUE       _U_(0x0000)  /**< \brief (PTC_RESULT reset_value) Result Conversion Value */

