Microchip-MPLAB-Harmony/touch/apps/onboard_sensor/firmware/src/packs/ATSAME54P20A_DFP/component/ptc.h
#define PTC_RESULT_RESULT_Pos       0            /**< \brief (PTC_RESULT) Result Conversion Value */
#define PTC_RESULT_RESULT_Msk       (_U_(0xFFFF) << PTC_RESULT_RESULT_Pos)
#define PTC_RESULT_RESULT(value)    (PTC_RESULT_RESULT_Msk & ((value) << PTC_RESULT_RESULT_Pos))
#define PTC_RESULT_MASK             _U_(0xFFFF)  /**< \brief (PTC_RESULT) MASK Register */

/* -------- PTC_RESS : (PTC Offset: 0x44) (R/  16) Last Sample Result -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t RESS:16;          /*!< bit:  0..15  Last PTC conversion result         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_RESS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_RESS_OFFSET             0x44         /**< \brief (PTC_RESS offset) Last Sample Result */
#define PTC_RESS_RESETVALUE         _U_(0x0000)  /**< \brief (PTC_RESS reset_value) Last Sample Result */

#define PTC_RESS_RESS_Pos           0            /**< \brief (PTC_RESS) Last PTC conversion result */
#define PTC_RESS_RESS_Msk           (_U_(0xFFFF) << PTC_RESS_RESS_Pos)
#define PTC_RESS_RESS(value)        (PTC_RESS_RESS_Msk & ((value) << PTC_RESS_RESS_Pos))
#define PTC_RESS_MASK               _U_(0xFFFF)  /**< \brief (PTC_RESS) MASK Register */

/* -------- PTC_CALIB : (PTC Offset: 0x48) (R/W 16) Calibration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t BIASCOMP:3;       /*!< bit:  0.. 2  Bias Comparator Scaling            */
    uint16_t :1;               /*!< bit:      3  Reserved                           */
    uint16_t BIASR2R:3;        /*!< bit:  4.. 6  Bias R2R Ampli scaling             */
    uint16_t :1;               /*!< bit:      7  Reserved                           */
    uint16_t BIASREFBUF:3;     /*!< bit:  8..10  Bias  Reference Buffer Scaling     */
    uint16_t :5;               /*!< bit: 11..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_CALIB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CALIB_OFFSET            0x48         /**< \brief (PTC_CALIB offset) Calibration */
#define PTC_CALIB_RESETVALUE        _U_(0x0000)  /**< \brief (PTC_CALIB reset_value) Calibration */

#define PTC_CALIB_BIASCOMP_Pos      0            /**< \brief (PTC_CALIB) Bias Comparator Scaling */
#define PTC_CALIB_BIASCOMP_Msk      (_U_(0x7) << PTC_CALIB_BIASCOMP_Pos)
#define PTC_CALIB_BIASCOMP(value)   (PTC_CALIB_BIASCOMP_Msk & ((value) << PTC_CALIB_BIASCOMP_Pos))
#define PTC_CALIB_BIASR2R_Pos       4            /**< \brief (PTC_CALIB) Bias R2R Ampli scaling */
#define PTC_CALIB_BIASR2R_Msk       (_U_(0x7) << PTC_CALIB_BIASR2R_Pos)
#define PTC_CALIB_BIASR2R(value)    (PTC_CALIB_BIASR2R_Msk & ((value) << PTC_CALIB_BIASR2R_Pos))
#define PTC_CALIB_BIASREFBUF_Pos    8            /**< \brief (PTC_CALIB) Bias  Reference Buffer Scaling */
#define PTC_CALIB_BIASREFBUF_Msk    (_U_(0x7) << PTC_CALIB_BIASREFBUF_Pos)
#define PTC_CALIB_BIASREFBUF(value) (PTC_CALIB_BIASREFBUF_Msk & ((value) << PTC_CALIB_BIASREFBUF_Pos))
#define PTC_CALIB_MASK              _U_(0x0777)  /**< \brief (PTC_CALIB) MASK Register */

/** \brief PTC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO PTC_CTRLA_Type            CTRLA;       /**< \brief Offset: 0x00 (R/W 16) Control A */
  __IO PTC_EVCTRL_Type           EVCTRL;      /**< \brief Offset: 0x02 (R/W  8) Event Control */
  __IO PTC_DBGCTRL_Type          DBGCTRL;     /**< \brief Offset: 0x03 (R/W  8) Debug Control */
  __IO PTC_INPUTCTRL_Type        INPUTCTRL;   /**< \brief Offset: 0x04 (R/W 16) Input Control */
  __IO PTC_CTRLB_Type            CTRLB;       /**< \brief Offset: 0x06 (R/W 16) Control B */
  __IO PTC_REFCTRL_Type          REFCTRL;     /**< \brief Offset: 0x08 (R/W  8) Reference Control */
       RoReg8                    Reserved1[0x1];
  __IO PTC_AVGCTRL_Type          AVGCTRL;     /**< \brief Offset: 0x0A (R/W  8) Average Control */
  __IO PTC_SAMPCTRL_Type         SAMPCTRL;    /**< \brief Offset: 0x0B (R/W  8) Sample Time Control */
  __IO PTC_WINLT_Type            WINLT;       /**< \brief Offset: 0x0C (R/W 16) Window Monitor Lower Threshold */
  __IO PTC_WINUT_Type            WINUT;       /**< \brief Offset: 0x0E (R/W 16) Window Monitor Upper Threshold */
  __IO PTC_GAINCORR_Type         GAINCORR;    /**< \brief Offset: 0x10 (R/W 16) Gain Correction */
  __IO PTC_OFFSETCORR_Type       OFFSETCORR;  /**< \brief Offset: 0x12 (R/W 16) Offset Correction */
  __IO PTC_SWTRIG_Type           SWTRIG;      /**< \brief Offset: 0x14 (R/W  8) Software Trigger */
       RoReg8                    Reserved2[0x3];
  __IO PTC_CTRLC_Type            CTRLC;       /**< \brief Offset: 0x18 (R/W 32) Control C */
  __IO PTC_CTRLD_Type            CTRLD;       /**< \brief Offset: 0x1C (R/W 32) Control D */
  __IO PTC_PINEN_Type            PINEN;       /**< \brief Offset: 0x20 (R/W 32) Pin Touch Enable */
  __IO PTC_XSEL_Type             XSEL;        /**< \brief Offset: 0x24 (R/W 32) X-lines Selection */
  __IO PTC_YSEL_Type             YSEL;        /**< \brief Offset: 0x28 (R/W 32) Y-lines Selection */
  __IO PTC_INTENCLR_Type         INTENCLR;    /**< \brief Offset: 0x2C (R/W  8) Interrupt Enable Clear */
  __IO PTC_INTENSET_Type         INTENSET;    /**< \brief Offset: 0x2D (R/W  8) Interrupt Enable Set */
  __IO PTC_INTFLAG_Type          INTFLAG;     /**< \brief Offset: 0x2E (R/W  8) Interrupt Flag Status and Clear */
  __I  PTC_STATUS_Type           STATUS;      /**< \brief Offset: 0x2F (R/   8) Status */
  __I  PTC_SYNCBUSY_Type         SYNCBUSY;    /**< \brief Offset: 0x30 (R/  32) Synchronization Busy */
  __O  PTC_DSEQDATA_Type         DSEQDATA;    /**< \brief Offset: 0x34 ( /W 32) DMA Sequencial Data */
  __IO PTC_DSEQCTRL_Type         DSEQCTRL;    /**< \brief Offset: 0x38 (R/W 32) DMA Sequential Control */
  __I  PTC_DSEQSTAT_Type         DSEQSTAT;    /**< \brief Offset: 0x3C (R/  32) DMA Sequencial Status */
  __I  PTC_RESULT_Type           RESULT;      /**< \brief Offset: 0x40 (R/  16) Result Conversion Value */
       RoReg8                    Reserved3[0x2];
  __I  PTC_RESS_Type             RESS;        /**< \brief Offset: 0x44 (R/  16) Last Sample Result */
       RoReg8                    Reserved4[0x2];
  __IO PTC_CALIB_Type            CALIB;       /**< \brief Offset: 0x48 (R/W 16) Calibration */
} QTML_Ptc;



#define QTML_PTC              ((QTML_Ptc      *)0x43001C00UL) /**< \brief (ADC0) APB Base Address */
#define QTML_PTC_0_IRQn        ADC0_OTHER_IRQn
#define QTML_PTC_1_IRQn        ADC0_RESRDY_IRQn


#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAME54_PTC_COMPONENT_ */
